jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16F527.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="16c5x" edc:desc="" edc:dosid="01660" edc:dsid="40001652" edc:hasfreeze="false" edc:informedby="DOS PS DS" edc:isdebuggable="false" edc:isextended="false" edc:masksetid="DE072" edc:name="PIC16F527" edc:procid="0xf527" edc:psid="40001640" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="11.000" edc:maxvoltage="12.000" edc:minvoltage="10.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="3.000" edc:minvoltage="2.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasealgo="3" edc:haschecksum="true" edc:lvpthresh="0" edc:memtech="ee" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="2000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="3000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="2000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="2000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="flashdata" edc:time="2000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="userid"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="flashdata"/>
    <edc:Wait edc:lvpgm="2000" edc:erase="10000" edc:pgm="3000" edc:cfg="2000" edc:userid="2000" edc:flashdata="2000"/>
    <edc:Latches edc:pgm="1" edc:cfg="1" edc:userid="1" edc:flashdata="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="16c5x" edc:name="16c5x">
    <edc:MemTraits edc:hwstackdepth="4">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:CalDataMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:NMMRMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="pic16f527"/>
  <edc:Breakpoints edc:hwbpcount="1"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x200" edc:issection="true" edc:regionid="page0" edc:sectiondesc="ROM code space" edc:sectionname="PROG0"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x400" edc:issection="true" edc:regionid="page1" edc:sectiondesc="ROM code space" edc:sectionname="PROG1"/>
    <edc:TestZone edc:beginaddr="0x440" edc:endaddr="0x4a0" edc:regionid="testmem"/>
    <edc:CalDataZone edc:beginaddr="0x3ff" edc:endaddr="0x400" edc:regionid="calmem"/>
    <edc:FlashDataSector edc:beginaddr="0x400" edc:endaddr="0x440" edc:issection="true" edc:regionid="flashdata" edc:sectiondesc="Writable Flash Data Memory" edc:sectionname="FLASHDATA"/>
    <edc:ConfigFuseSector edc:beginaddr="0xFFF" edc:endaddr="0x1000" edc:regionid=".config">
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG" edc:desc="" edc:factorydefault="0x3ff" edc:impl="0x3ff" edc:name="CONFIG" edc:nzwidth="0xa" edc:unused="0x0000" edc:useinchecksum="0x3ff" edc:default="0x3ff" edc:_addr="0xFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection" edc:mask="0x7" edc:name="FOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator and automatic 18 ms DRT (DRTEN ignored)" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator and automatic 18 ms DRT (DRTEN ignored)" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator and automatic 18 ms DRT (DRTEN ignored)" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator with I/O function on OSC2/CLKOUT and 10 us startup time" edc:when="(field &amp; 0x7) == 0x3">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTRC_IO" edc:desc="INTRC with I/O function on OSC2/CLKOUT and 10 us startup time" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTRC_CLKOUT" edc:desc="INTRC with CLKOUT function on OSC2/CLKOUT and 10 us startup time" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EXTRC_IO" edc:desc="EXTRC with I/O function on OSC2/CLKOUT and 10 us startup time" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EXTRC_CLKOUT" edc:desc="EXTRC with CLKOUT function on OSC2/CLKOUT and 10 us startup time" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="WDTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protection - User Program Memory" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection off" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection on" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x40" edc:checksumalgo="0x20" edc:endaddr="0x3ff"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="Master Clear Enable" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MCLR pin functions as MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="MCLR pin functions as I/O, MCLR internally tied to Vdd" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOSCFS" edc:desc="Internal Oscillator Frequency Select" edc:mask="0x1" edc:name="IOSCFS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="8MHz" edc:desc="8 MHz INTOSC Speed" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="4MHz" edc:desc="4 MHz INTOSC Speed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPSW" edc:desc="Code Protection - Self Writable Memory" edc:mask="0x1" edc:name="CPSW" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection off" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection on" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable" edc:mask="0x1" edc:name="BOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOR Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOR Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DRTEN" edc:desc="Device Reset Timer Enable" edc:mask="0x1" edc:name="DRTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DRT Enabled (18 ms)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DRT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:beginaddr="0x440" edc:endaddr="0x444" edc:issection="true" edc:regionid=".idlocs" edc:sectiondesc="ID locations" edc:sectionname="IDLOCS"/>
  </edc:ProgramSpace>
  <edc:DataSpace>
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0" edc:beginaddr="0x00" edc:endaddr="0x0c" edc:regionid="sfr0">
        <edc:SFRDef edc:access="--------" edc:cname="INDF" edc:desc="" edc:impl="0xff" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="INDF" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0x0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF" edc:desc="" edc:mask="0xff" edc:name="INDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:mask="0xff" edc:name="TMR0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PCL" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:mask="0xff" edc:name="PCL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="STATUS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0011uuu" edc:name="STATUS" edc:nzwidth="0x8" edc:por="-0011xxx" edc:_addr="0x3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:desc="" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:desc="" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PA0" edc:desc="" edc:mask="0x1" edc:name="PA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PA1" edc:desc="" edc:mask="0x1" edc:name="PA1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="CARRY" edc:desc="" edc:mask="0x1" edc:name="CARRY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ZERO" edc:desc="" edc:mask="0x1" edc:name="ZERO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="FSR" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0xxxxxxx" edc:name="FSR" edc:nzwidth="0x8" edc:por="0xxxxxxx" edc:_addr="0x4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR" edc:desc="" edc:mask="0x7f" edc:name="FSR" edc:nzwidth="7"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
